examples/request/SetVolume.xml

<Request>
  <url>
    http://{ip}:1400/MediaRenderer/RenderingControl/Control
  </url>
  <action>
    "urn:schemas-upnp-org:service:RenderingControl:1#SetVolume"
  </action>
  <message>
    <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"
      s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
      <s:Body>
        <u:SetVolume xmlns:u="urn:schemas-upnp-org:service:RenderingControl:1">
          <InstanceID>0</InstanceID>
          <Channel>Master</Channel>
          <DesiredVolume>{}</DesiredVolume>
        </u:SetVolume>
      </s:Body>
    </s:Envelope>
  </message>
</Request>
